{
  "vocab_to_idx": {
    "<UNK>": 0,
    "the": 1,
    "of": 2,
    "and": 3,
    "to": 4,
    "that": 5,
    "is": 6,
    "for": 7,
    "in": 8,
    "we": 9,
    "with": 10,
    "an": 11,
    "on": 12,
    "which": 13,
    "transformation": 14,
    "as": 15,
    "transformer": 16,
    "are": 17,
    "by": 18,
    "action": 19,
    "models": 20,
    "this": 21,
    "be": 22,
    "visual": 23,
    "model": 24,
    "or": 25,
    "tint": 26,
    "magnets": 27,
    "fine": 28,
    "paper": 29,
    "group": 30,
    "rotation": 31,
    "boost": 32,
    "new": 33,
    "patches": 34,
    "representations": 35,
    "not": 36,
    "language": 37,
    "quantum": 38,
    "space": 39,
    "transform": 40,
    "can": 41,
    "our": 42,
    "architecture": 43,
    "features": 44,
    "attention": 45,
    "transformers": 46,
    "into": 47,
    "local": 48,
    "high": 49,
    "these": 50,
    "performance": 51,
    "tnt": 52,
    "words": 53,
    "will": 54,
    "representation": 55,
    "state": 56,
    "large": 57,
    "pre": 58,
    "trained": 59,
    "internal": 60,
    "construction": 61,
    "many": 62,
    "design": 63,
    "show": 64,
    "over": 65,
    "like": 66,
    "transformations": 67,
    "digroup": 68,
    "covariant": 69,
    "it": 70,
    "wavelets": 71,
    "functional": 72,
    "calculus": 73,
    "generators": 74,
    "magnetic": 75,
    "velocity": 76,
    "coordinate": 77,
    "matrix": 78,
    "terms": 79,
    "if": 80,
    "expression": 81,
    "order": 82,
    "surface": 83,
    "input": 84,
    "data": 85,
    "first": 86,
    "divide": 87,
    "images": 88,
    "several": 89,
    "then": 90,
    "both": 91,
    "their": 92,
    "out": 93,
    "inside": 94,
    "also": 95,
    "times": 96,
    "sentences": 97,
    "further": 98,
    "computational": 99,
    "experiments": 100,
    "higher": 101,
    "than": 102,
    "code": 103,
    "available": 104,
    "at": 105,
    "https": 106,
    "com": 107,
    "cv": 108,
    "mindspore": 109,
    "research": 110,
    "recent": 111,
    "works": 112,
    "learning": 113,
    "tuning": 114,
    "linear": 115,
    "during": 116,
    "inference": 117,
    "however": 118,
    "such": 119,
    "more": 120,
    "work": 121,
    "propose": 122,
    "simulate": 123,
    "tune": 124,
    "introduce": 125,
    "allow": 126,
    "its": 127,
    "end": 128,
    "modeling": 129,
    "one": 130,
    "opt": 131,
    "compared": 132,
    "classical": 133,
    "form": 134,
    "partial": 135,
    "hat": 136,
    "where": 137,
    "beta": 138,
    "curvature": 139,
    "geometry": 140,
    "theory": 141,
    "coherent": 142,
    "states": 143,
    "vectors": 144,
    "hardy": 145,
    "operator": 146,
    "function": 147,
    "numerical": 148,
    "lorentz": 149,
    "rotations": 150,
    "boosts": 151,
    "direction": 152,
    "commutation": 153,
    "relations": 154,
    "written": 155,
    "approach": 156,
    "fields": 157,
    "maxwell": 158,
    "finite": 159,
    "values": 160,
    "exponential": 161,
    "expansion": 162,
    "equal": 163,
    "condition": 164,
    "equations": 165,
    "field": 166,
    "based": 167,
    "extend": 168,
    "novel": 169,
    "dc": 170,
    "correspondence": 171,
    "rational": 172,
    "bundles": 173,
    "environment": 174,
    "kind": 175,
    "neural": 176,
    "encodes": 177,
    "powerful": 178,
    "via": 179,
    "mechanism": 180,
    "basically": 181,
    "calculate": 182,
    "relationship": 183,
    "since": 184,
    "natural": 185,
    "complexity": 186,
    "abundant": 187,
    "detail": 188,
    "color": 189,
    "information": 190,
    "granularity": 191,
    "patch": 192,
    "dividing": 193,
    "enough": 194,
    "excavating": 195,
    "objects": 196,
    "different": 197,
    "scales": 198,
    "locations": 199,
    "point": 200,
    "essential": 201,
    "building": 202,
    "explore": 203,
    "namely": 204,
    "specifically": 205,
    "regard": 206,
    "present": 207,
    "them": 208,
    "smaller": 209,
    "each": 210,
    "word": 211,
    "calculated": 212,
    "other": 213,
    "given": 214,
    "sentence": 215,
    "negligible": 216,
    "costs": 217,
    "aggregated": 218,
    "enhance": 219,
    "ability": 220,
    "benchmarks": 221,
    "demonstrate": 222,
    "effectiveness": 223,
    "proposed": 224,
    "achieve": 225,
    "top": 226,
    "accuracy": 227,
    "imagenet": 228,
    "about": 229,
    "art": 230,
    "similar": 231,
    "cost": 232,
    "pytorch": 233,
    "github": 234,
    "huawei": 235,
    "noah": 236,
    "backbones": 237,
    "gitee": 238,
    "tree": 239,
    "master": 240,
    "attribute": 241,
    "capability": 242,
    "context": 243,
    "icl": 244,
    "implicitly": 245,
    "simulating": 246,
    "layer": 247,
    "mlp": 248,
    "constructions": 249,
    "require": 250,
    "memory": 251,
    "overhead": 252,
    "makes": 253,
    "simulation": 254,
    "sophisticated": 255,
    "intractable": 256,
    "efficient": 257,
    "short": 258,
    "allows": 259,
    "complex": 260,
    "internally": 261,
    "particular": 262,
    "innovative": 263,
    "approximation": 264,
    "techniques": 265,
    "less": 266,
    "billion": 267,
    "parameters": 268,
    "million": 269,
    "parameter": 270,
    "within": 271,
    "single": 272,
    "forward": 273,
    "pass": 274,
    "accommodates": 275,
    "common": 276,
    "variants": 277,
    "ideas": 278,
    "improve": 279,
    "efficiency": 280,
    "past": 281,
    "instantiations": 282,
    "simple": 283,
    "conduct": 284,
    "validate": 285,
    "procedure": 286,
    "various": 287,
    "downstream": 288,
    "tasks": 289,
    "example": 290,
    "even": 291,
    "limited": 292,
    "step": 293,
    "budget": 294,
    "observe": 295,
    "improves": 296,
    "absolute": 297,
    "average": 298,
    "findings": 299,
    "suggest": 300,
    "capable": 301,
    "performing": 302,
    "intricate": 303,
    "subroutines": 304,
    "facilitate": 305,
    "modular": 306,
    "extensible": 307,
    "codebase": 308,
    "included": 309,
    "stationary": 310,
    "hamilton": 311,
    "jacobi": 312,
    "equation": 313,
    "non": 314,
    "relativistic": 315,
    "systems": 316,
    "underlying": 317,
    "bohmian": 318,
    "mechanics": 319,
    "takes": 320,
    "replaced": 321,
    "dq": 322,
    "sqrt": 323,
    "term": 324,
    "essentially": 325,
    "coincides": 326,
    "potential": 327,
    "turns": 328,
    "proportional": 329,
    "arising": 330,
    "projective": 331,
    "agreement": 332,
    "recently": 333,
    "formulated": 334,
    "equivalence": 335,
    "principle": 336,
    "indicate": 337,
    "potentials": 338,
    "deform": 339,
    "notion": 340,
    "prove": 341,
    "every": 342,
    "isomorphic": 343,
    "develops": 344,
    "inspired": 345,
    "wavelet": 346,
    "was": 347,
    "observed": 348,
    "interesting": 349,
    "types": 350,
    "arise": 351,
    "from": 352,
    "square": 353,
    "integrable": 354,
    "vacuum": 355,
    "admissible": 356,
    "extends": 357,
    "applicability": 358,
    "popular": 359,
    "classic": 360,
    "examples": 361,
    "banach": 362,
    "spaces": 363,
    "others": 364,
    "keywords": 365,
    "littlewood": 366,
    "paley": 367,
    "berezin": 368,
    "radon": 369,
    "moebius": 370,
    "map": 371,
    "maximal": 372,
    "affine": 373,
    "special": 374,
    "range": 375,
    "characteristic": 376,
    "describes": 377,
    "particularly": 378,
    "didactic": 379,
    "transparent": 380,
    "derivation": 381,
    "basic": 382,
    "properties": 383,
    "along": 384,
    "arbitrary": 385,
    "well": 386,
    "functions": 387,
    "unit": 388,
    "define": 389,
    "axis": 390,
    "electrodynamics": 391,
    "electric": 392,
    "instead": 393,
    "stress": 394,
    "tensor": 395,
    "angle": 396,
    "collectively": 397,
    "denoted": 398,
    "existence": 399,
    "gv": 400,
    "generator": 401,
    "requires": 402,
    "derivative": 403,
    "respect": 404,
    "gm": 405,
    "only": 406,
    "satisfied": 407,
    "additive": 408,
    "indeed": 409,
    "case": 410,
    "but": 411,
    "velocities": 412,
    "assumed": 413,
    "exists": 414,
    "being": 415,
    "above": 416,
    "imposed": 417,
    "hyperbolic": 418,
    "cosh": 419,
    "sinh": 420,
    "recovered": 421,
    "arc": 422,
    "tanh": 423,
    "determined": 424,
    "general": 425,
    "containing": 426,
    "sum": 427,
    "product": 428,
    "calculations": 429,
    "second": 430,
    "third": 431,
    "used": 432,
    "reliably": 433,
    "infer": 434,
    "expressions": 435,
    "without": 436,
    "having": 437,
    "recourse": 438,
    "transformationmatrices": 439,
    "weyl": 440,
    "spinors": 441,
    "derived": 442,
    "leading": 443,
    "angular": 444,
    "momentum": 445,
    "studied": 446,
    "invariant": 447,
    "under": 448,
    "optics": 449,
    "magneto": 450,
    "statics": 451,
    "through": 452,
    "some": 453,
    "illusions": 454,
    "created": 455,
    "shirking": 456,
    "cancelling": 457,
    "overlapping": 458,
    "designed": 459,
    "verified": 460,
    "simulations": 461,
    "open": 462,
    "door": 463,
    "designing": 464,
    "controlling": 465,
    "there": 466,
    "beautiful": 467,
    "between": 468,
    "configurations": 469,
    "lines": 470,
    "tautological": 471,
    "families": 472,
    "means": 473,
    "generalized": 474,
    "fourier": 475,
    "mukai": 476,
    "relates": 477,
    "spectral": 478,
    "fibration": 479,
    "what": 480,
    "defines": 481,
    "kicking": 482,
    "ball": 483,
    "argue": 484,
    "true": 485,
    "meaning": 486,
    "lies": 487,
    "change": 488,
    "brings": 489,
    "actions": 490,
    "changes": 491,
    "before": 492,
    "happens": 493,
    "precondition": 494,
    "after": 495,
    "effect": 496,
    "motivated": 497,
    "advancements": 498,
    "video": 499,
    "using": 500,
    "deep": 501,
    "siamese": 502,
    "network": 503,
    "level": 504,
    "feature": 505,
    "gives": 506,
    "improvements": 507,
    "standard": 508,
    "recognition": 509,
    "datasets": 510,
    "including": 511,
    "ucf": 512,
    "hmdb": 513,
    "importantly": 514,
    "able": 515,
    "generalize": 516,
    "beyond": 517,
    "learned": 518,
    "categories": 519,
    "shows": 520,
    "significant": 521,
    "improvement": 522,
    "cross": 523,
    "category": 524,
    "generalization": 525,
    "act": 526,
    "dataset": 527,
    "mean": 528,
    "introduced": 529,
    "morphs": 530,
    "triangulated": 531,
    "surfaces": 532,
    "round": 533,
    "spheres": 534
  },
  "idx_to_vocab": {
    "0": "<UNK>",
    "1": "the",
    "2": "of",
    "3": "and",
    "4": "to",
    "5": "that",
    "6": "is",
    "7": "for",
    "8": "in",
    "9": "we",
    "10": "with",
    "11": "an",
    "12": "on",
    "13": "which",
    "14": "transformation",
    "15": "as",
    "16": "transformer",
    "17": "are",
    "18": "by",
    "19": "action",
    "20": "models",
    "21": "this",
    "22": "be",
    "23": "visual",
    "24": "model",
    "25": "or",
    "26": "tint",
    "27": "magnets",
    "28": "fine",
    "29": "paper",
    "30": "group",
    "31": "rotation",
    "32": "boost",
    "33": "new",
    "34": "patches",
    "35": "representations",
    "36": "not",
    "37": "language",
    "38": "quantum",
    "39": "space",
    "40": "transform",
    "41": "can",
    "42": "our",
    "43": "architecture",
    "44": "features",
    "45": "attention",
    "46": "transformers",
    "47": "into",
    "48": "local",
    "49": "high",
    "50": "these",
    "51": "performance",
    "52": "tnt",
    "53": "words",
    "54": "will",
    "55": "representation",
    "56": "state",
    "57": "large",
    "58": "pre",
    "59": "trained",
    "60": "internal",
    "61": "construction",
    "62": "many",
    "63": "design",
    "64": "show",
    "65": "over",
    "66": "like",
    "67": "transformations",
    "68": "digroup",
    "69": "covariant",
    "70": "it",
    "71": "wavelets",
    "72": "functional",
    "73": "calculus",
    "74": "generators",
    "75": "magnetic",
    "76": "velocity",
    "77": "coordinate",
    "78": "matrix",
    "79": "terms",
    "80": "if",
    "81": "expression",
    "82": "order",
    "83": "surface",
    "84": "input",
    "85": "data",
    "86": "first",
    "87": "divide",
    "88": "images",
    "89": "several",
    "90": "then",
    "91": "both",
    "92": "their",
    "93": "out",
    "94": "inside",
    "95": "also",
    "96": "times",
    "97": "sentences",
    "98": "further",
    "99": "computational",
    "100": "experiments",
    "101": "higher",
    "102": "than",
    "103": "code",
    "104": "available",
    "105": "at",
    "106": "https",
    "107": "com",
    "108": "cv",
    "109": "mindspore",
    "110": "research",
    "111": "recent",
    "112": "works",
    "113": "learning",
    "114": "tuning",
    "115": "linear",
    "116": "during",
    "117": "inference",
    "118": "however",
    "119": "such",
    "120": "more",
    "121": "work",
    "122": "propose",
    "123": "simulate",
    "124": "tune",
    "125": "introduce",
    "126": "allow",
    "127": "its",
    "128": "end",
    "129": "modeling",
    "130": "one",
    "131": "opt",
    "132": "compared",
    "133": "classical",
    "134": "form",
    "135": "partial",
    "136": "hat",
    "137": "where",
    "138": "beta",
    "139": "curvature",
    "140": "geometry",
    "141": "theory",
    "142": "coherent",
    "143": "states",
    "144": "vectors",
    "145": "hardy",
    "146": "operator",
    "147": "function",
    "148": "numerical",
    "149": "lorentz",
    "150": "rotations",
    "151": "boosts",
    "152": "direction",
    "153": "commutation",
    "154": "relations",
    "155": "written",
    "156": "approach",
    "157": "fields",
    "158": "maxwell",
    "159": "finite",
    "160": "values",
    "161": "exponential",
    "162": "expansion",
    "163": "equal",
    "164": "condition",
    "165": "equations",
    "166": "field",
    "167": "based",
    "168": "extend",
    "169": "novel",
    "170": "dc",
    "171": "correspondence",
    "172": "rational",
    "173": "bundles",
    "174": "environment",
    "175": "kind",
    "176": "neural",
    "177": "encodes",
    "178": "powerful",
    "179": "via",
    "180": "mechanism",
    "181": "basically",
    "182": "calculate",
    "183": "relationship",
    "184": "since",
    "185": "natural",
    "186": "complexity",
    "187": "abundant",
    "188": "detail",
    "189": "color",
    "190": "information",
    "191": "granularity",
    "192": "patch",
    "193": "dividing",
    "194": "enough",
    "195": "excavating",
    "196": "objects",
    "197": "different",
    "198": "scales",
    "199": "locations",
    "200": "point",
    "201": "essential",
    "202": "building",
    "203": "explore",
    "204": "namely",
    "205": "specifically",
    "206": "regard",
    "207": "present",
    "208": "them",
    "209": "smaller",
    "210": "each",
    "211": "word",
    "212": "calculated",
    "213": "other",
    "214": "given",
    "215": "sentence",
    "216": "negligible",
    "217": "costs",
    "218": "aggregated",
    "219": "enhance",
    "220": "ability",
    "221": "benchmarks",
    "222": "demonstrate",
    "223": "effectiveness",
    "224": "proposed",
    "225": "achieve",
    "226": "top",
    "227": "accuracy",
    "228": "imagenet",
    "229": "about",
    "230": "art",
    "231": "similar",
    "232": "cost",
    "233": "pytorch",
    "234": "github",
    "235": "huawei",
    "236": "noah",
    "237": "backbones",
    "238": "gitee",
    "239": "tree",
    "240": "master",
    "241": "attribute",
    "242": "capability",
    "243": "context",
    "244": "icl",
    "245": "implicitly",
    "246": "simulating",
    "247": "layer",
    "248": "mlp",
    "249": "constructions",
    "250": "require",
    "251": "memory",
    "252": "overhead",
    "253": "makes",
    "254": "simulation",
    "255": "sophisticated",
    "256": "intractable",
    "257": "efficient",
    "258": "short",
    "259": "allows",
    "260": "complex",
    "261": "internally",
    "262": "particular",
    "263": "innovative",
    "264": "approximation",
    "265": "techniques",
    "266": "less",
    "267": "billion",
    "268": "parameters",
    "269": "million",
    "270": "parameter",
    "271": "within",
    "272": "single",
    "273": "forward",
    "274": "pass",
    "275": "accommodates",
    "276": "common",
    "277": "variants",
    "278": "ideas",
    "279": "improve",
    "280": "efficiency",
    "281": "past",
    "282": "instantiations",
    "283": "simple",
    "284": "conduct",
    "285": "validate",
    "286": "procedure",
    "287": "various",
    "288": "downstream",
    "289": "tasks",
    "290": "example",
    "291": "even",
    "292": "limited",
    "293": "step",
    "294": "budget",
    "295": "observe",
    "296": "improves",
    "297": "absolute",
    "298": "average",
    "299": "findings",
    "300": "suggest",
    "301": "capable",
    "302": "performing",
    "303": "intricate",
    "304": "subroutines",
    "305": "facilitate",
    "306": "modular",
    "307": "extensible",
    "308": "codebase",
    "309": "included",
    "310": "stationary",
    "311": "hamilton",
    "312": "jacobi",
    "313": "equation",
    "314": "non",
    "315": "relativistic",
    "316": "systems",
    "317": "underlying",
    "318": "bohmian",
    "319": "mechanics",
    "320": "takes",
    "321": "replaced",
    "322": "dq",
    "323": "sqrt",
    "324": "term",
    "325": "essentially",
    "326": "coincides",
    "327": "potential",
    "328": "turns",
    "329": "proportional",
    "330": "arising",
    "331": "projective",
    "332": "agreement",
    "333": "recently",
    "334": "formulated",
    "335": "equivalence",
    "336": "principle",
    "337": "indicate",
    "338": "potentials",
    "339": "deform",
    "340": "notion",
    "341": "prove",
    "342": "every",
    "343": "isomorphic",
    "344": "develops",
    "345": "inspired",
    "346": "wavelet",
    "347": "was",
    "348": "observed",
    "349": "interesting",
    "350": "types",
    "351": "arise",
    "352": "from",
    "353": "square",
    "354": "integrable",
    "355": "vacuum",
    "356": "admissible",
    "357": "extends",
    "358": "applicability",
    "359": "popular",
    "360": "classic",
    "361": "examples",
    "362": "banach",
    "363": "spaces",
    "364": "others",
    "365": "keywords",
    "366": "littlewood",
    "367": "paley",
    "368": "berezin",
    "369": "radon",
    "370": "moebius",
    "371": "map",
    "372": "maximal",
    "373": "affine",
    "374": "special",
    "375": "range",
    "376": "characteristic",
    "377": "describes",
    "378": "particularly",
    "379": "didactic",
    "380": "transparent",
    "381": "derivation",
    "382": "basic",
    "383": "properties",
    "384": "along",
    "385": "arbitrary",
    "386": "well",
    "387": "functions",
    "388": "unit",
    "389": "define",
    "390": "axis",
    "391": "electrodynamics",
    "392": "electric",
    "393": "instead",
    "394": "stress",
    "395": "tensor",
    "396": "angle",
    "397": "collectively",
    "398": "denoted",
    "399": "existence",
    "400": "gv",
    "401": "generator",
    "402": "requires",
    "403": "derivative",
    "404": "respect",
    "405": "gm",
    "406": "only",
    "407": "satisfied",
    "408": "additive",
    "409": "indeed",
    "410": "case",
    "411": "but",
    "412": "velocities",
    "413": "assumed",
    "414": "exists",
    "415": "being",
    "416": "above",
    "417": "imposed",
    "418": "hyperbolic",
    "419": "cosh",
    "420": "sinh",
    "421": "recovered",
    "422": "arc",
    "423": "tanh",
    "424": "determined",
    "425": "general",
    "426": "containing",
    "427": "sum",
    "428": "product",
    "429": "calculations",
    "430": "second",
    "431": "third",
    "432": "used",
    "433": "reliably",
    "434": "infer",
    "435": "expressions",
    "436": "without",
    "437": "having",
    "438": "recourse",
    "439": "transformationmatrices",
    "440": "weyl",
    "441": "spinors",
    "442": "derived",
    "443": "leading",
    "444": "angular",
    "445": "momentum",
    "446": "studied",
    "447": "invariant",
    "448": "under",
    "449": "optics",
    "450": "magneto",
    "451": "statics",
    "452": "through",
    "453": "some",
    "454": "illusions",
    "455": "created",
    "456": "shirking",
    "457": "cancelling",
    "458": "overlapping",
    "459": "designed",
    "460": "verified",
    "461": "simulations",
    "462": "open",
    "463": "door",
    "464": "designing",
    "465": "controlling",
    "466": "there",
    "467": "beautiful",
    "468": "between",
    "469": "configurations",
    "470": "lines",
    "471": "tautological",
    "472": "families",
    "473": "means",
    "474": "generalized",
    "475": "fourier",
    "476": "mukai",
    "477": "relates",
    "478": "spectral",
    "479": "fibration",
    "480": "what",
    "481": "defines",
    "482": "kicking",
    "483": "ball",
    "484": "argue",
    "485": "true",
    "486": "meaning",
    "487": "lies",
    "488": "change",
    "489": "brings",
    "490": "actions",
    "491": "changes",
    "492": "before",
    "493": "happens",
    "494": "precondition",
    "495": "after",
    "496": "effect",
    "497": "motivated",
    "498": "advancements",
    "499": "video",
    "500": "using",
    "501": "deep",
    "502": "siamese",
    "503": "network",
    "504": "level",
    "505": "feature",
    "506": "gives",
    "507": "improvements",
    "508": "standard",
    "509": "recognition",
    "510": "datasets",
    "511": "including",
    "512": "ucf",
    "513": "hmdb",
    "514": "importantly",
    "515": "able",
    "516": "generalize",
    "517": "beyond",
    "518": "learned",
    "519": "categories",
    "520": "shows",
    "521": "significant",
    "522": "improvement",
    "523": "cross",
    "524": "category",
    "525": "generalization",
    "526": "act",
    "527": "dataset",
    "528": "mean",
    "529": "introduced",
    "530": "morphs",
    "531": "triangulated",
    "532": "surfaces",
    "533": "round",
    "534": "spheres"
  },
  "vocab_size": 535,
  "total_words": 534
}